; domain
(define (domain gripper-strips)
(:requirements :strips)
   (:predicates (room ?r)
		(ball ?b)
		(gripper ?g)
		(at-robby ?r)
		(not-broken ?g)
		(at ?b ?r)
		(free ?g)
		(carry ?o ?g))

   (:action move
       :parameters  (?from ?to)
       :precondition (and  (room ?from) (room ?to) (at-robby ?from))
       :effect (and  (at-robby ?to)
		     (not (at-robby ?from))))



   (:action pick
       :parameters (?obj ?room ?gripper)
       :precondition  (and  (ball ?obj) (room ?room) (gripper ?gripper) (not-broken ?gripper)
			    (at ?obj ?room) (at-robby ?room) (free ?gripper))
       :effect (and (carry ?obj ?gripper)
		    (not (at ?obj ?room)) 
		    (not (free ?gripper))))
		    

   (:action drop
       :parameters  (?obj  ?room ?gripper)
       :precondition  (and  (ball ?obj) (room ?room) (gripper ?gripper) (not-broken ?gripper)
			    (carry ?obj ?gripper) (at-robby ?room))
       :effect (and (at ?obj ?room)
		    (free ?gripper)
		    (not (carry ?obj ?gripper))
		    ))
		    
		    

		    
		    
	(:action drop-both
      :parameters  (?obj1 ?obj2 ?room ?gripper1 ?gripper2)
      :precondition  (and  (ball ?obj1) (ball ?obj2) (room ?room) (gripper ?gripper1) (gripper ?gripper2) (not-broken ?gripper1) (not-broken ?gripper2)
			    (carry ?obj1 ?gripper1) (carry ?obj2 ?gripper2) (at-robby ?room))
      :effect (and (at ?obj1 ?room) (at ?obj2 ?room)
		    (free ?gripper1) (free ?gripper2)
		    (not (carry ?obj1 ?gripper1))
		    (not (carry ?obj2 ?gripper2)))))

; problem
(define (problem strips-gripper-x-1)
   (:domain gripper-strips)
   (:objects rooma roomb ball2 ball1 left right)
   (:init (room rooma)
          (room roomb)
        
          (ball ball2)
          (ball ball1)
          (at-robby rooma)
          (free left)
          (free right)
          (not-broken left)
          (not-broken right)  
            
          (at ball2 rooma)
          (at ball1 rooma)
          (gripper left)
          (gripper right))
   (:goal (and 
               (at ball2 roomb)
               (at ball1 roomb))))

; plan
1. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 0 of 2
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 0 of 2
3. (drop ball2 roomb left)
   deleted: (carry ball2 left)
   added: (at ball2 roomb) (free left)
   goals met: 1 of 2
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 1 of 2
5. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 1 of 2
6. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 1 of 2
7. (drop ball1 roomb right)
   deleted: (carry ball1 right)
   added: (at ball1 roomb) (free right)
   goals met: 2 of 2
